package com.administration.bureau.constant;

import com.administration.bureau.App;

import java.util.ArrayList;
import java.util.Locale;

/**
 * Created by omyrobin on 2017/4/7.
 */

public class Constant {
    public static final int SELECT_CAMERA = 0;//拍照

    public static final int SELECT_CHOOSER = 1;//相册

    public static final int SELECT_CONTRACT_OF_TENANCY = 2;//房屋租赁合同照片

    public static final int MY_PERMISSIONS_REQUEST_CALL_CAMERA = 0;

    public static final int MY_PERMISSIONS_REQUEST_CALL_CHOOSER = 1;

    public static final String USER_ID = "USER_ID";//用户ID

    public static final String USER_PHONE = "USER_PHONE";//用户手机号

    public static final String USER_TOKEN = "USER_TOKEN";//用户Token

    public static final String LOCALE = "LOCALE";

    public static String[] languages = new String[]{"zh-CN", "en"};

    public static final int PASSPORT_INFO = 0;//护照信息页

    public static final int ENTRY_PAGE = 1;//入境页

    public static final int VISA_PAGE = 2;//签证页

    public static final String CN_COUNTRY_PHONE = "{\n" +
            "\t\"中国 \": \"86\",\n" +
            "\t\" 阿尔巴尼亚\": \" 355\",\n" +
            "\t\" 阿尔及利亚\": \" 213\",\n" +
            "\t\" 阿富汗\": \" 93\",\n" +
            "\t\" 阿根廷\": \" 54\",\n" +
            "\t\" 阿拉伯联合酋长国, 阿拉伯\": \" 971\",\n" +
            "\t\" 阿鲁巴岛\": \" 297\",\n" +
            "\t\" 阿曼\": \" 968\",\n" +
            "\t\" 阿塞拜疆\": \" 994\",\n" +
            "\t\" 阿森松\": \" 247\",\n" +
            "\t\" 埃及\": \" 20\",\n" +
            "\t\" 埃塞俄比亚\": \" 251\",\n" +
            "\t\" 爱尔兰\": \" 353\",\n" +
            "\t\" 爱沙尼亚\": \" 372\",\n" +
            "\t\" 安道尔\": \" 376\",\n" +
            "\t\" 安哥拉\": \" 1264\",\n" +
            "\t\" 安圭拉\": \" 244\",\n" +
            "\t\" 安提瓜和巴布达岛岛\": \" 1268\",\n" +
            "\t\" 澳大利亚\": \" 61\",\n" +
            "\t\" 奥地利\": \" 43\",\n" +
            "\t\" 巴巴多斯\": \" 1246\",\n" +
            "\t\" 巴布亚新几内亚\": \" 675\",\n" +
            "\t\" 巴哈马\": \" 1809\",\n" +
            "\t\" 巴基斯坦\": \" 92\",\n" +
            "\t\" 巴拉圭\": \" 595\",\n" +
            "\t\" 巴勒斯坦\": \" 930\",\n" +
            "\t\" 巴林\": \" 973\",\n" +
            "\t\" 巴拿马\": \" 507\",\n" +
            "\t\" 巴西\": \" 55\",\n" +
            "\t\" 白俄罗斯\": \" 375\",\n" +
            "\t\" 百慕大群岛\": \" 1441\",\n" +
            "\t\" 保加利亚\": \" 359\",\n" +
            "\t\" 北马里亚纳群岛\": \" 1670\",\n" +
            "\t\" 贝宁\": \" 229\",\n" +
            "\t\" 比利时\": \" 32\",\n" +
            "\t\" 冰岛\": \" 354\",\n" +
            "\t\" 波多黎各\": \" 1787\",\n" +
            "\t\" 波兰\": \" 48\",\n" +
            "\t\" 玻利维亚\": \" 591\",\n" +
            "\t\" 波斯尼亚和黑塞哥维那\": \" 387\",\n" +
            "\t\" 博茨瓦纳\": \" 267\",\n" +
            "\t\" 伯利兹\": \" 501\",\n" +
            "\t\" 不丹\": \" 975\",\n" +
            "\t\" 布基纳法索\": \" 226\",\n" +
            "\t\" 布隆迪\": \" 257\",\n" +
            "\t\" 朝鲜\": \" 850\",\n" +
            "\t\" 丹麦\": \" 45\",\n" +
            "\t\" 德国\": \" 49\",\n" +
            "\t\" 东帝汶\": \" 670\",\n" +
            "\t\" 多哥\": \" 228\",\n" +
            "\t\" 多米尼加\": \" 1890\",\n" +
            "\t\" 多米尼加共和国\": \" 1809\",\n" +
            "\t\" 俄罗斯\": \" 7\",\n" +
            "\t\" 厄瓜多尔\": \" 593\",\n" +
            "\t\" 厄立特里亚\": \" 291\",\n" +
            "\t\" 法国\": \" 33\",\n" +
            "\t\" 法罗群岛\": \" 298\",\n" +
            "\t\" 法属波利尼西亚\": \" 689\",\n" +
            "\t\" 法属圭亚那\": \" 240\",\n" +
            "\t\" 法国南部领土\": \" 33\",\n" +
            "\t\" 梵蒂冈\": \" 379\",\n" +
            "\t\" 菲律宾\": \" 63\",\n" +
            "\t\" 斐济\": \" 679\",\n" +
            "\t\" 芬兰\": \" 358\",\n" +
            "\t\" 佛得角\": \" 238\",\n" +
            "\t\" 弗兰克群岛\": \" 49\",\n" +
            "\t\" 冈比亚\": \" 220\",\n" +
            "\t\" 刚果\": \" 242\",\n" +
            "\t\" 刚果民主共和国\": \" 242\",\n" +
            "\t\" 哥伦比亚\": \" 001\",\n" +
            "\t\" 哥斯达黎加\": \" 506\",\n" +
            "\t\" 英属格恩西\": \" 502\",\n" +
            "\t\" 格林纳达\": \" 1809\",\n" +
            "\t\" 格陵兰\": \" 45\",\n" +
            "\t\" 古巴\": \" 53\",\n" +
            "\t\" 瓜德罗普\": \" 53\",\n" +
            "\t\" 关岛\": \" 1671\",\n" +
            "\t\" 圭亚那\": \" 592\",\n" +
            "\t\" 哈萨克斯坦\": \" 007\",\n" +
            "\t\" 海地\": \" 509\",\n" +
            "\t\" 韩国\": \" 82\",\n" +
            "\t\" 荷兰\": \" 31\",\n" +
            "\t\" 荷属安的列斯群岛\": \" 599\",\n" +
            "\t\" 洪都拉斯\": \" 504\",\n" +
            "\t\" 基里巴斯\": \" 686\",\n" +
            "\t\" 吉布提\": \" 253\",\n" +
            "\t\" 吉尔吉斯斯坦\": \" 331\",\n" +
            "\t\" 几内亚\": \" 224\",\n" +
            "\t\" 几内亚比绍\": \" 245\",\n" +
            "\t\" 加拿大\": \" 001\",\n" +
            "\t\" 加纳\": \"233\",\n" +
            "\t\" 加蓬\": \" 241\",\n" +
            "\t\" 柬埔寨\": \" 855\",\n" +
            "\t\" 捷克共和国\": \" 420\",\n" +
            "\t\" 津巴布韦\": \" 263\",\n" +
            "\t\" 喀麦隆\": \" 237\",\n" +
            "\t\" 卡塔尔\": \" 974\",\n" +
            "\t\" 开曼群岛\": \" 1345\",\n" +
            "\t\" 科科斯群岛\": \" 61\",\n" +
            "\t\" 科摩罗\": \" 269\",\n" +
            "\t\" 科特迪瓦\": \" 225\",\n" +
            "\t\" 科威特\": \" 965\",\n" +
            "\t\" 克罗地亚\": \" 385\",\n" +
            "\t\" 肯尼亚\": \" 254\",\n" +
            "\t\" 库克群岛\": \" 682\",\n" +
            "\t\" 拉脱维亚\": \" 371\",\n" +
            "\t\" 莱索托\": \" 266\",\n" +
            "\t\" 老挝\": \" 856\",\n" +
            "\t\" 黎巴嫩\": \" 961\",\n" +
            "\t\" 利比里亚\": \" 231\",\n" +
            "\t\" 利比亚\": \" 218\",\n" +
            "\t\" 立陶宛\": \" 370\",\n" +
            "\t\" 列支敦士登\": \" 423\",\n" +
            "\t\" 留尼旺岛\": \" 262\",\n" +
            "\t\" 卢森堡\": \" 352\",\n" +
            "\t\" 卢旺达\": \" 250\",\n" +
            "\t\" 罗马尼亚\": \" 40\",\n" +
            "\t\" 马达加斯加\": \" 261\",\n" +
            "\t\" 马尔代夫\": \" 960\",\n" +
            "\t\" 马耳他\": \" 356\",\n" +
            "\t\" 马拉维\": \" 265\",\n" +
            "\t\" 马来西亚\": \" 60\",\n" +
            "\t\" 马里\": \" 223\",\n" +
            "\t\" 马绍尔群岛\": \" 692\",\n" +
            "\t\" 马提尼克\": \" 596\",\n" +
            "\t\" 科摩罗马约特岛\": \" 262\",\n" +
            "\t\" 毛里求斯\": \" 230\",\n" +
            "\t\" 毛里塔尼亚\": \" 222\",\n" +
            "\t\" 美国\": \" 001\",\n" +
            "\t\" 美属萨摩亚\": \" 685\",\n" +
            "\t\" 蒙古\": \" 976\",\n" +
            "\t\" 普利茅斯\": \" 1664\",\n" +
            "\t\" 孟加拉\": \" 880\",\n" +
            "\t\" 密克罗尼西亚\": \" 691\",\n" +
            "\t\" 秘鲁\": \" 51\",\n" +
            "\t\" 缅甸\": \" 95\",\n" +
            "\t\" 摩尔多瓦\": \" 373\",\n" +
            "\t\" 摩洛哥\": \" 212\",\n" +
            "\t\" 摩纳哥\": \" 377\",\n" +
            "\t\" 莫桑比克\": \" 258\",\n" +
            "\t\" 墨西哥\": \" 52\",\n" +
            "\t\" 纳米比亚\": \" 264\",\n" +
            "\t\" 南非\": \" 27\",\n" +
            "\t\" 南极洲\": \" 672\",\n" +
            "\t\" 瑙鲁\": \" 674\",\n" +
            "\t\" 尼泊尔\": \" 977\",\n" +
            "\t\" 尼加拉瓜\": \" 505\",\n" +
            "\t\" 尼日尔\": \" 227\",\n" +
            "\t\" 尼日利亚\": \" 234\",\n" +
            "\t\" 纽埃\": \" 683\",\n" +
            "\t\" 挪威\": \" 47\",\n" +
            "\t\" 诺福克岛\": \" 6723\",\n" +
            "\t\" 帕劳群岛\": \" 680\",\n" +
            "\t\" 格鲁吉亚\": \" 995\",\n" +
            "\t\" 日本\": \" 81\",\n" +
            "\t\" 瑞典\": \" 46\",\n" +
            "\t\" 瑞士\": \" 41\",\n" +
            "\t\" 萨摩亚\": \" 684\",\n" +
            "\t\" 塞尔维亚, 黑山\": \" 381\",\n" +
            "\t\" 塞拉利昂\": \" 232\",\n" +
            "\t\" 塞内加尔\": \" 221\",\n" +
            "\t\" 塞浦路斯\": \" 357\",\n" +
            "\t\" 塞舌尔\": \" 248\",\n" +
            "\t\" 沙特阿拉伯\": \" 966\",\n" +
            "\t\" 圣诞岛\": \" 618\",\n" +
            "\t\" 圣多美和普林西比\": \" 239\",\n" +
            "\t\" 圣海伦娜\": \" 290\",\n" +
            "\t\" 圣基茨和尼维斯\": \" 1784\",\n" +
            "\t\" 露西亚\": \" 1758\",\n" +
            "\t\" 圣马利诺\": \" 378\",\n" +
            "\t\" 圣文森特和格林纳丁斯\": \" 1784\",\n" +
            "\t\" 斯里兰卡\": \" 94\",\n" +
            "\t\" 斯洛伐克\": \" 421\",\n" +
            "\t\" 斯洛文尼亚\": \" 386\",\n" +
            "\t\" 斯威士兰\": \" 268\",\n" +
            "\t\" 苏丹\": \"249\",\n" +
            "\t\" 苏里南\": \" 597\",\n" +
            "\t\" 所罗门群岛\": \" 677\",\n" +
            "\t\" 索马里\": \" 252\",\n" +
            "\t\" 塔吉克斯坦\": \" 992\",\n" +
            "\t\" 泰国\": \" 66\",\n" +
            "\t\" 坦桑尼亚\": \" 255\",\n" +
            "\t\" 汤加\": \" 676\",\n" +
            "\t\" 土耳其人和凯特西群岛\": \" 1649\",\n" +
            "\t\"塔吉克斯坦\": \" 992\",\n" +
            "\t\" 特立尼达和多巴哥\": \" 1868\",\n" +
            "\t\" 突尼斯\": \" 216\",\n" +
            "\t\" 图瓦卢\": \" 688\",\n" +
            "\t\" 土耳其\": \" 90\",\n" +
            "\t\" 土库曼斯坦\": \" 992\",\n" +
            "\t\" 托克劳\": \" 690\",\n" +
            "\t\" 沃利斯和富图纳\": \" 681\",\n" +
            "\t\" 瓦努阿图\": \" 678\",\n" +
            "\t\" 瓜地马拉\": \" 502\",\n" +
            "\t\" 维尔京群岛, 美国\": \" 1340\",\n" +
            "\t\" 维尔京群岛, 英国人\": \" 1284\",\n" +
            "\t\" 委内瑞拉\": \" 58\",\n" +
            "\t\" 文莱\": \" 673\",\n" +
            "\t\" 乌干达\": \" 256\",\n" +
            "\t\" 乌克兰\": \" 380\",\n" +
            "\t\" 乌拉圭\": \" 598\",\n" +
            "\t\" 乌兹别克斯坦\": \" 233\",\n" +
            "\t\" 西班牙\": \" 34\",\n" +
            "\t\" 希腊\": \" 30\",\n" +
            "\t\" 新加坡\": \" 65\",\n" +
            "\t\" 新喀里多尼亚\": \" 687\",\n" +
            "\t\" 新西兰\": \" 64\",\n" +
            "\t\" 匈牙利\": \" 36\",\n" +
            "\t\" 叙利亚\": \" 963\",\n" +
            "\t\" 牙买加\": \" 1876\",\n" +
            "\t\" 亚美尼亚\": \" 374\",\n" +
            "\t\" 也门\": \" 967\",\n" +
            "\t\" 伊拉克\": \" 964\",\n" +
            "\t\" 伊朗\": \" 98\",\n" +
            "\t\" 以色列\": \" 972\",\n" +
            "\t\" 意大利\": \" 39\",\n" +
            "\t\" 印度\": \" 91\",\n" +
            "\t\" 印度尼西亚\": \" 62\",\n" +
            "\t\" 英国\": \" 44\",\n" +
            "\t\" 约旦\": \" 962\",\n" +
            "\t\" 越南\": \" 84\",\n" +
            "\t\" 赞比亚\": \" 260\",\n" +
            "\t\" 乍得\": \" 235\",\n" +
            "\t\" 直布罗陀\": \" 350\",\n" +
            "\t\" 智利\": \" 56\",\n" +
            "\t\" 中非共和国\": \" 236\"\n" +
            "}";


    public static final String EN_COUNTRY_PHONE = "{\n" +
            "\t\"China\": \"86\",\n" +
            "\t\"Albania\": \"355\",\n" +
            "\t\"Algeria\": \"213\",\n" +
            "\t\"Afghanistan\": \"93\",\n" +
            "\t\"Argentina\": \"54\",\n" +
            "\t\"United Arab Emirates, Arabia\": \"971\",\n" +
            "\t\"Aruba\": \"297\",\n" +
            "\t\"Oman\": \"968\",\n" +
            "\t\"Azerbaijan\": \"994\",\n" +
            "\t\"Ascension\": \"247\",\n" +
            "\t\"Egypt\": \"20\",\n" +
            "\t\"Ethiopia\": \"251\",\n" +
            "\t\"Ireland\": \"353\",\n" +
            "\t\"Estonia\": \"372\",\n" +
            "\t\"Andorra\": \"376\",\n" +
            "\t\"Angola\": \"1264\",\n" +
            "\t\"Anguilla\": \"244\",\n" +
            "\t\"The island of Antigua and barbuda\": \"1268\",\n" +
            "\t\"Australia\": \"61\",\n" +
            "\t\"Austria\": \"43\",\n" +
            "\t\"Barbados\": \"1246\",\n" +
            "\t\"Papua New Guinea\": \"675\",\n" +
            "\t\"Bahamas\": \"1809\",\n" +
            "\t\"Pakistan\": \"92\",\n" +
            "\t\"Paraguay\": \"595\",\n" +
            "\t\"Palestine\": \"930\",\n" +
            "\t\"Bahrain\": \"973\",\n" +
            "\t\"Panama\": \"507\",\n" +
            "\t\"Brazil\": \"55\",\n" +
            "\t\"Belarus\": \"375\",\n" +
            "\t\"Bermuda\": \"1441\",\n" +
            "\t\"Bulgaria\": \"359\",\n" +
            "\t\"The Northern Mariana islands\": \"1670\",\n" +
            "\t\"Benin\": \"229\",\n" +
            "\t\"Belgium\": \"32\",\n" +
            "\t\"Iceland\": \"354\",\n" +
            "\t\"Puerto Rico\": \"1787\",\n" +
            "\t\"Poland\": \"48\",\n" +
            "\t\"Bolivia\": \"591\",\n" +
            "\t\"Bosnia and herzegovina\": \"387\",\n" +
            "\t\"Botswana\": \"267\",\n" +
            "\t\"Belize\": \"501\",\n" +
            "\t\"Bhutan\": \"975\",\n" +
            "\t\"Burkina Faso\": \"226\",\n" +
            "\t\"Burundi\": \"257\",\n" +
            "\t\"North Korea\": \"850\",\n" +
            "\t\"Denmark\": \"45\",\n" +
            "\t\"Germany\": \"49\",\n" +
            "\t\"East Timor\": \"670\",\n" +
            "\t\"Togo\": \"228\",\n" +
            "\t\"Dominica\": \"1890\",\n" +
            "\t\"The Republic of Dominica\": \"1809\",\n" +
            "\t\"Russia\": \"7\",\n" +
            "\t\"Ecuador\": \"593\",\n" +
            "\t\"Eritrea\": \"291\",\n" +
            "\t\"France\": \"33\",\n" +
            "\t\"Faroe Islands\": \"298\",\n" +
            "\t\"French polynesia\": \"689\",\n" +
            "\t\"French guiana\": \"240\",\n" +
            "\t\"The French Southern territories\": \"33\",\n" +
            "\t\"The Vatican\": \"379\",\n" +
            "\t\"Philippines\": \"63\",\n" +
            "\t\"Fiji\": \"679\",\n" +
            "\t\"Finland\": \"358\",\n" +
            "\t\"Cape Verde\": \"238\",\n" +
            "\t\"The Frank islands\": \"49\",\n" +
            "\t\"Gambia\": \"220\",\n" +
            "\t\"Congo\": \"242\",\n" +
            "\t\"The Democratic Republic of Congo\": \"242\",\n" +
            "\t\"Columbia\": \"001\",\n" +
            "\t\"Costa Rica\": \"506\",\n" +
            "\t\"Guernsey\": \"502\",\n" +
            "\t\"Grenada\": \"1809\",\n" +
            "\t\"Greenland\": \"45\",\n" +
            "\t\"Cuba\": \"53\",\n" +
            "\t\"Guadeloupe\": \"53\",\n" +
            "\t\"Guam\": \"1671\",\n" +
            "\t\"Guyana\": \"592\",\n" +
            "\t\"Kazakhstan\": \"007\",\n" +
            "\t\"Haiti\": \"509\",\n" +
            "\t\"Korea\": \"82\",\n" +
            "\t\"Holland\": \"31\",\n" +
            "\t\"The Netherlands antilles\": \"599\",\n" +
            "\t\"Honduras\": \"504\",\n" +
            "\t\"Kiribati\": \"686\",\n" +
            "\t\"Djibouti\": \"253\",\n" +
            "\t\"Kyrgyzstan\": \"331\",\n" +
            "\t\"Guinea\": \"224\",\n" +
            "\t\"Guinea Bissau\": \"245\",\n" +
            "\t\"Canada\": \"001\",\n" +
            "\t\"Garner\": \"233\",\n" +
            "\t\"Gabon\": \"241\",\n" +
            "\t\"Kampuchea\": \"855\",\n" +
            "\t\"Czech Republic\": \"420\",\n" +
            "\t\"Zimbabwe\": \"263\",\n" +
            "\t\"Cameroon\": \"237\",\n" +
            "\t\"Qatar\": \"974\",\n" +
            "\t\"The Cayman Islands\": \"1345\",\n" +
            "\t\"The Cocos islands\": \"61\",\n" +
            "\t\"Comoros\": \"269\",\n" +
            "\t\"Cote d'Ivoire\": \"225\",\n" +
            "\t\"Kuwait\": \"965\",\n" +
            "\t\"Croatia\": \"385\",\n" +
            "\t\"Kenya\": \"254\",\n" +
            "\t\"The Cook islands\": \"682\",\n" +
            "\t\"Latvia\": \"371\",\n" +
            "\t\"Lesotho\": \"266\",\n" +
            "\t\"Laos\": \"856\",\n" +
            "\t\"Lebanon\": \"961\",\n" +
            "\t\"Liberia\": \"231\",\n" +
            "\t\"Libya\": \"218\",\n" +
            "\t\"Lithuania\": \"370\",\n" +
            "\t\"Liechtenstein\": \"423\",\n" +
            "\t\"Reunion\": \"262\",\n" +
            "\t\"Luxemburg\": \"352\",\n" +
            "\t\"Rwanda\": \"250\",\n" +
            "\t\"Romania\": \"40\",\n" +
            "\t\"Madagascar\": \"261\",\n" +
            "\t\"Maldives\": \"960\",\n" +
            "\t\"Malta\": \"356\",\n" +
            "\t\"Malawi\": \"265\",\n" +
            "\t\"Malaysia\": \"60\",\n" +
            "\t\"Mali\": \"223\",\n" +
            "\t\"The Marshall islands\": \"692\",\n" +
            "\t\"Martinique\": \"596\",\n" +
            "\t\"Mayotte\": \"262\",\n" +
            "\t\"Mauritius\": \"230\",\n" +
            "\t\"Mauritania\": \"222\",\n" +
            "\t\"The United States\": \"001\",\n" +
            "\t\"American Samoa\": \"685\",\n" +
            "\t\"Mongolia\": \"976\",\n" +
            "\t\"Montserrat\": \"1664\",\n" +
            "\t\"Bangladesh\": \"880\",\n" +
            "\t\"Micronesia\": \"691\",\n" +
            "\t\"Peru\": \"51\",\n" +
            "\t\"Burma\": \"95\",\n" +
            "\t\"Moldova\": \"373\",\n" +
            "\t\"Morocco\": \"212\",\n" +
            "\t\"Monaco\": \"377\",\n" +
            "\t\"Mozambique\": \"258\",\n" +
            "\t\"Mexico\": \"52\",\n" +
            "\t\"Namibia\": \"264\",\n" +
            "\t\"South Africa\": \"27\",\n" +
            "\t\"Antarctica\": \"672\",\n" +
            "\t\"Nauru\": \"674\",\n" +
            "\t\"Nepal\": \"977\",\n" +
            "\t\"Nicaragua\": \"505\",\n" +
            "\t\"Niger\": \"227\",\n" +
            "\t\"Nigeria\": \"234\",\n" +
            "\t\"Niue\": \"683\",\n" +
            "\t\"Norway\": \"47\",\n" +
            "\t\"Norfolk\": \"6723\",\n" +
            "\t\"Palau islands\": \"680\",\n" +
            "\t\"Portuguese\": \"80\",\n" +
            "\t\"Georgia\": \"995\",\n" +
            "\t\"Japan\": \"81\",\n" +
            "\t\"Sweden\": \"46\",\n" +
            "\t\"Switzerland\": \"41\",\n" +
            "\t\"Samoa\": \"684\",\n" +
            "\t\"Serbia, Montenegro\": \"381\",\n" +
            "\t\"Sierra Leone\": \"232\",\n" +
            "\t\"Senegal\": \"221\",\n" +
            "\t\"Cyprus\": \"357\",\n" +
            "\t\"Seychelles\": \"248\",\n" +
            "\t\"Saudi Arabia\": \"966\",\n" +
            "\t\"Christmas Island\": \"618\",\n" +
            "\t\"Sao Tome and principe\": \"239\",\n" +
            "\t\"St. helena\": \"290\",\n" +
            "\t\"Saint Kitts and nevis\": \"1784\",\n" +
            "\t\"Lucia\": \"1758\",\n" +
            "\t\"San marino\": \"378\",\n" +
            "\t\"Saint Vincent and the grenadines\": \"1784\",\n" +
            "\t\"Sri Lanka\": \"94\",\n" +
            "\t\"Slovakia\": \"421\",\n" +
            "\t\"Slovenia\": \"386\",\n" +
            "\t\"Swaziland\": \"268\",\n" +
            "\t\"Sultan\": \"249\",\n" +
            "\t\"Suriname\": \"597\",\n" +
            "\t\"The Solomon islands\": \"677\",\n" +
            "\t\"Somalia\": \"252\",\n" +
            "\t\"Tajikistan\": \"992\",\n" +
            "\t\"Thailand\": \"66\",\n" +
            "\t\"Tanzania\": \"255\",\n" +
            "\t\"Tonga\": \"676\",\n" +
            "\t\"The Turks and Kaiketesi islands\": \"1649\",\n" +
            "\t\"Tristan Da khuon ha\": \"992\",\n" +
            "\t\"Trinidad and Tobago\": \"1868\",\n" +
            "\t\"Tunisia\": \"216\",\n" +
            "\t\"Tuvalu\": \"688\",\n" +
            "\t\"Turkey\": \"90\",\n" +
            "\t\"Turkmenistan\": \"992\",\n" +
            "\t\"Tokelau\": \"690\",\n" +
            "\t\"Wallis and futuna\": \"681\",\n" +
            "\t\"Vanuatu\": \"678\",\n" +
            "\t\"Guatemala\": \"502\",\n" +
            "\t\"The Virgin Islands, American\": \"1340\",\n" +
            "\t\"The Virgin Islands, the British\": \"1284\",\n" +
            "\t\"Venezuela\": \"58\",\n" +
            "\t\"Brunei\": \"673\",\n" +
            "\t\"Uganda\": \"256\",\n" +
            "\t\"Ukraine\": \"380\",\n" +
            "\t\"Uruguay\": \"598\",\n" +
            "\t\"Uzbekistan\": \"233\",\n" +
            "\t\"Spain\": \"34\",\n" +
            "\t\"Greece\": \"30\",\n" +
            "\t\"Singapore\": \"65\",\n" +
            "\t\"New Caledonia\": \"687\",\n" +
            "\t\"New Zealand\": \"64\",\n" +
            "\t\"Hungary\": \"36\",\n" +
            "\t\"Syria\": \"963\",\n" +
            "\t\"Jamaica\": \"1876\",\n" +
            "\t\"Armenia\": \"374\",\n" +
            "\t\"Yemen\": \"967\",\n" +
            "\t\"Iraq\": \"964\",\n" +
            "\t\"Iran\": \"98\",\n" +
            "\t\"Israel\": \"972\",\n" +
            "\t\"Italy\": \"39\",\n" +
            "\t\"India\": \"91\",\n" +
            "\t\"Indonesia\": \"62\",\n" +
            "\t\"Britain\": \"44\",\n" +
            "\t\"Jordan\": \"962\",\n" +
            "\t\"Vietnam\": \"84\",\n" +
            "\t\"Zambia\": \"260\",\n" +
            "\t\"Chad\": \"235\",\n" +
            "\t\"Gibraltar\": \"350\",\n" +
            "\t\"Chile\": \"56\",\n" +
            "\t\"The Central African Republic\": \"236\"\n" +
            "}";
}
